# Лабораторная работа 2. Задание №4

# Инициализация
print('Сумма  введенных натуральных чисел')

# Бесконечный цикл
while True:

    print('\nДля завершения программы введите любой не числовой символ, отрицательное число "N" или число "0".\n')
    N = input('Введите первое число "N": ') 

    # Выход из бесконечного цикл
    if not N.isdigit() or int(N) == 0:
        break
    else:
        N = int(N) 

    # Формирования списка "N" чисел
    my_list = []
    for i in range(N):
        a = input('Введите натуральное число для вычисления суммы: ')

        # Проверка корректности ввода числа для вычесления суммы (только натуральные числа)
        if not a.isdigit() or int(a) == 0:
            print('Введено не натуральное число')
            f = 1
            break
        else:
            a = int(a)
            my_list.append(a)
            f = 0
        
    # Вывод суммы введеных чисел
    if f == 0:
        print(f'Сумма введенных чисел равна: {sum(my_list)}')

# Завершение работы программы
print('\n\aПока, пока ...')