# Инициализация
print('Лабораторная работа 2. Задание №5\nПеревод введенного двоичного числа в десятичное число')

# Бесконечный цикл
while True:

    print('\nДля завершения программы введите любой не числовой символ или отрицательное число.\n')
    a = input('Введите число в двоичной системе счисления длиной не более 10 символов: ')

    # Выход из бесконечного цикл
    if not a.isdigit(): break 

    # Проверка корректности введенного числа (не более 10 знаков)
    dlina = len(a)
    if dlina > 10:
        print('Вводить нужно не более 10 символов')
        f = 1
    else:
        for i in range(dlina):
            if int(a[i]) <= 1:
                chislo_dec = 0
                f = 0
            else:
                print('Двоичное число состойт только из "0" или "1"')
                f = 1    
                break
        
    # Перевод двоичного числа в десятичное расчетным путем
    if f == 0:
        for i in range(dlina):
            if int(a[i]) <= 1:
                chislo_dec +=  int(a[i]) * (2 ** (dlina - i - 1))

    # Вывод десятичного чисела
    if f == 0:
        print(f'\nВывод десятичного чисела: {chislo_dec}')

    # Алтернативный вывод десятичного чисела
    if f == 0:
        print(f'\nАлтернативный вывод десятичного чисела: {int(a, 2)}')

# Завершение работы программы
print('\n\aПока, пока ...')
