# Задание № 8

# Инициализация
print('Сущществует ли треугольник с заданными сторонами?')

# Бесконечный цикл
while True:

    # Пригласительная строка
    print('Для завершения программы введите любой не числовой символ или отрицательное число \n')

    # Ввод длины стороны "a"
    a = input('Введите длину стороны "a": ')

    # Выход из бесконечного цикл
    if not a.isdigit(): break
     
    # Ввод длины стороны "b"
    b = input('Введите длину стороны "b": ')

    # Выход из бесконечного цикл
    if not b.isdigit(): break 

    # Ввод длины стороны "c"
    c = input('Введите длину стороны "c": ')

    # Выход из бесконечного цикл
    if not c.isdigit(): break 

    # Определение условия существования треугольника со сторонами "a", "b", "c"
    if (int(a) < int(c) + int(b)) and (int(b) < int(a) + int(c)) and (int(c) < int(a) + int(b)):
        f = 1
    else: 
        f = 0
        
    # Определение существования треугольника со сторонами "a", "b", "c"
    if f != 0:
       print (f'\nНе вырожденный треугольник со сторонами {a=},{b=} и {c=} существует!\n')
    else:
        print (f'\nНе вырожденный треугольник со сторонами {a=},{b=} и {c=} не существует!\n')

# Завершение работы программы
print('\n\aПока, пока ...')