# Инициализация
print('Лабораторная работа 2. Задание №3\nНатуральные делители числа "x".')

# Бесконечный цикл
while True:

    print('\nДля завершения программы введите любой не числовой символ, число меньшее или равное 0.\n')
    x = input('Введите число "x": ') 

    # Выход из бесконечного цикл
    if not x.isdigit()  or int(x) <= 0:
        break
    else:
        x = int(x)

    # Формирования списка делителя числа от 1 до x (включительно)
    my_list = [i for i in range(1,x + 1)if (x % i) == 0]

    # Вывод списка делителей числа
    print(f'\nВывод списка делителей числа: ')
    for i in my_list:
        print(i, end=" ")

    # Альтернативный вывод списка делителей числа
    print(f'\n\nАльтернативный вывод списка делителей числа: \n{" ".join(map(str, my_list))}')

# Завершение работы программы
print('\n\aПока, пока ...')